emacs/.emacs.d/emacs.org
** Hydra

leader-key是general定义的leader-key

#+begin_src emacs-lisp
(use-package hydra)
(defhydra hydra-text-scale (:timeout 4)
  "scale text"
  ("j" text-scale-increase "in")
  ("k" text-scale-decrease "out")
  ("f" nil "finished" :exit t))
(leader-key "ts" '(hydra-text-scale/body :which-key "scale text"))

(defhydra hydra-dap-debug (:timeout 4)
  "dap debug"
  ("c" dap-continue "continue" :exit t)
  ("n" dap-next "next")
  ("i" dap-step-in "step in")
  ("o" dap-step-out "step out")
  ("q" nil "quit" :exit t))
(leader-key "dd" '(hydra-dap-debug/body :which-key "dap debug"))
#+end_src

** Ace Jump Mode
#+begin_src emacs-lisp
(use-package ace-jump-mode
  :bind ("C-." . ace-jump-mode))
#+end_src

** Evil
#+begin_src emacs-lisp
;; (use-package evil-leader
;;   :config
;;     (global-evil-leader-mode) ; enable global-evil-leader-mode before evil-mode
;;     (evil-leader/set-leader ";")
;;    (evil-leader/set-key
;;        "e" 'treemacs ; 太浪费，不常用，但占用了短快捷键
;;        "q" 'quit-window
;;        "k" 'kill-buffer
;;        "b" 'counsel-ibuffer
;;        "dd" 'dap-debug-last
;;        "dr" 'dap-debug-restart
;;        "dq" 'dap-disconnect
;;        "db" 'dap-breakpoint-toggle
;;        "dc" 'dap-continue
;;        "dn" 'dap-next
;;        "di" 'dap-step-in
;;        "do" 'dap-step-out
;;        "SPC" 'ace-jump-word-mode
;;        "jb" 'ace-jump-mode-pop-mark
;;        "jc" 'ace-jump-char-mode
;;        "jl" 'ace-jump-line-mode
;;        "jw" 'ace-jump-word-mode
;;        ";" 'evil-repeat-find-char))
(defun aq/set-evil-key (s f)
  (evil-define-key 'normal 'global (kbd (concat "<leader>" s)) f))

;; origami toggle使用origami-forward-toggle-node
(defun aq/evil-fold-origami-forward (mode-actions)
  (if (eq (caar mode-actions) 'origami-mode)
      (cons
       (car mode-actions)
       (plist-put (cdr mode-actions)
                  :toggle (lambda () (origami-forward-toggle-node (current-buffer) (point)))))
    mode-actions))

(use-package undo-tree
  :config
  (global-undo-tree-mode)
  (setq undo-tree-history-directory-alist '(("." . "~/.emacs.d/undo-tree"))))

(use-package evil
  :init
  (setq evil-undo-system 'undo-tree)
  ;; (setq evil-want-integration t) ;; default is true
  (setq evil-want-keybinding nil)
  ;;  :after (evil-leader)
  :config
  (setq evil-fold-list (mapcar #'aq/evil-fold-origami-forward evil-fold-list))
  (evil-mode 1)
  ;; (evil-set-leader '(normal motion) ";")
  (evil-set-leader 'normal ";")
  (aq/set-evil-key "e" 'treemacs) ; 太浪费，不常用，但占用了短快捷键
  (aq/set-evil-key "q" 'quit-window)
  (aq/set-evil-key "x" 'delete-window)
  (aq/set-evil-key "k" 'kill-buffer)
  (aq/set-evil-key "b" 'counsel-ibuffer)
  (aq/set-evil-key "s" 'save-buffer)
  (aq/set-evil-key "dd" 'dap-debug-last)
  (aq/set-evil-key "dr" 'dap-debug-restart)
  (aq/set-evil-key "dq" 'dap-disconnect)
  (aq/set-evil-key "db" 'dap-breakpoint-toggle)
  (aq/set-evil-key "dc" 'dap-continue)
  (aq/set-evil-key "dn" 'dap-next)
  (aq/set-evil-key "di" 'dap-step-in)
  (aq/set-evil-key "do" 'dap-step-out)
  (aq/set-evil-key "SPC" 'ace-jump-word-mode)
  (aq/set-evil-key "jb" 'ace-jump-mode-pop-mark)
  (aq/set-evil-key "jc" 'ace-jump-char-mode)
  (aq/set-evil-key "jl" 'ace-jump-line-mode)
  (aq/set-evil-key "jw" 'ace-jump-word-mode)
  (aq/set-evil-key "pg" 'go-playground)
  (aq/set-evil-key ";" 'evil-repeat-find-char))

;; (use-package evil-collection
;;   :after evil
;;   :config (evil-collection-init))

;; vim style C-g
(global-set-key (kbd "<escape>") 'keyboard-escape-quit)

;; use ~gcc~ to toggle comment
(use-package evil-commentary
  :after evil
  :config (evil-commentary-mode))

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

#+end_src

** 非unicode编码文件探测
#+begin_src emacs-lisp
(use-package unicad)
#+end_src
* 系统设置
同步系统PATH设置
#+begin_src emacs-lisp
(use-package exec-path-from-shell)
(when (memq window-system '(mac ns x))
  (exec-path-from-shell-initialize))
#+end_src

** MacOS
#+begin_src emacs-lisp
(setq mac-command-modifier 'meta)
#+end_src

