emacs/.emacs.d/emacs.org
* OrgMode
#+begin_src emacs-lisp
(defun aq/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1))
    ;;  (setq evil-auto-indent nil))
    ;;  (auto-fill-mode 0)

(use-package org
	:hook (org-mode . aq/org-mode-setup)
	:config
	(setq org-edit-src-content-indentation 0)
	(setq org-ellipsis " ▾")
	(setq org-hide-emphasis-markers t)

	(setq org-agenda-start-with-log-mode t)
	(setq org-log-done 'time)
	(setq org-log-into-drawer t)

	(setq org-todo-keywords
	'((sequence "TODO(t)" "DOING(i)" "PENDING(p)" "|" "DONE(d!)" "REJECTED(r)")
		(sequence "BACKLOG(b)" "PLAN(p)" "READY(r)" "ACTIVE(a)" "REVIEW(v)" "WAIT(w@/!)" "HOLD(h)" "|" "COMPLETED(c)" "CANC(k@)")))

	;; TODO
	;; Custom agenda view
	;; https://github.com/daviwil/emacs-from-scratch/blob/5e1f99448e32852277e2d274ce2057d55b8c7aaf/init.el#L300
	;; Capture templates
	(setq org-capture-templates
	`(("t" "Tasks / Projects")
		("tt" "Task" entry (file+olp "~/Nextcloud/OrgMode/Tasks.org" "Inbox")
		"* TODO %?\n  %U\n  %a\n  %i" :empty-lines 1)))

	;; (setq org-agenda-files '("~/Nextcloud/OrgMode/wiki/editors/emacs/emacs-from-scratch.org"))
	;; (setq org-agenda-files '("~/Nextcloud/OrgMode/"))
	(setq org-agenda-files (directory-files-recursively "~/Nextcloud/OrgMode/" "\\.org$"))
	(setq org-directory "~/Nextcloud/OrgMode/")

	;; org mode heading font size
	(dolist (face '((org-level-1 . 1.2)
					(org-level-2 . 1.1)
					(org-level-3 . 1.05)
					(org-level-4 . 1.0)
					(org-level-5 . 1.0)
					(org-level-6 . 1.0)
					(org-level-7 . 1.0)
					(org-level-8 . 1.0)))
	;;  (message "%s" (cdr face)))
	;;  (set-face-attribute (car face) nil :font "YaHei Consolas Hybrid" :weight 'regular :height (cdr face)))
	(set-face-attribute (car face) nil :font "FiraCode Nerd Font" :weight 'regular :height (cdr face)))

	;; Ensure that anything that should be fixed-pitch in Org files appears that way
	(set-face-attribute 'org-block nil    :foreground nil :inherit 'fixed-pitch)
	(set-face-attribute 'org-table nil    :inherit 'fixed-pitch)
	(set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
	(set-face-attribute 'org-code nil     :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-table nil    :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
	(set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
	(set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
	(set-face-attribute 'org-checkbox nil  :inherit 'fixed-pitch)
	(set-face-attribute 'line-number nil :inherit 'fixed-pitch)
	(set-face-attribute 'line-number-current-line nil :inherit 'fixed-pitch))

(use-package org-bullets
	:hook (org-mode . org-bullets-mode)
	:custom
	(org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))


;; org mode 居中显示
(defun aq/org-mode-visual-fill ()
	(setq visual-fill-column-width 100
	visual-fill-column-center-text t)
	(visual-fill-column-mode))
(use-package visual-fill-column
	:defer t
	:hook (org-mode . aq/org-mode-visual-fill))

(setq org-babel-python-command "python3")
(with-eval-after-load 'org
	(org-babel-do-load-languages
	'org-babel-load-languages
	'((emacs-lisp . t)
;;       (go . t)
		(python . t)))
	(setq org-confirm-babel-evaluate nil))

(with-eval-after-load 'org
	(require 'org-tempo)
	(add-to-list 'org-structure-template-alist '("sh" . "src shell"))
	(add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
	(add-to-list 'org-structure-template-alist '("py" . "src python")))

;; org mode (Refer: org mode guide)
(global-set-key (kbd "C-c l") #'org-store-link)
(global-set-key (kbd "C-c a") #'org-agenda)
(global-set-key (kbd "C-c c") #'org-capture)

;; 自动展开加粗斜体等marker
(use-package org-appear
  :after org
	:hook (org-mode . org-appear-mode))
#+end_src

** Babel
#+begin_src emacs-lisp

#+end_src
** 自动生成init.el
#+begin_src emacs-lisp
(defun aq/org-babel-tangle-config ()
  ;;  (when (string-equal (file-name-directory buffer-file-name)
  ;;                      (expand-file-name user-emacs-directory))
  (when (string-equal (file-name-nondirectory
                       (directory-file-name
                        (file-name-directory buffer-file-name)))
                      ".emacs.d")
    ;; Dynamic scoping to the rescue
    (let ((org-confirm-babel-evaluate nil))
      (org-babel-tangle))))

(add-hook 'org-mode-hook (lambda () (add-hook 'after-save-hook #'aq/org-babel-tangle-config)))
#+end_src

* EShell
* 程序开发

需求
- 语法高亮
- 自动补全
- debug运行
- snippets
  
** Project
#+begin_src emacs-lisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap ("C-c p" . projectile-command-map)
  :init
  (when (file-directory-p "~/Projects")
    ;; (setq projectile-project-search-path '(("~/Projects" . 2))))
    (setq projectile-project-search-path '(("~/Projects" . 1)
                                           ("~/Projects/github" . 1))))
  (setq projectile-switch-project-action #'projectile-dired)
  (setq projectile-enable-caching t)
  :config
  ;; add cmake sub project
  ;; https://github.com/bbatsov/projectile/issues/1130#issuecomment-1123237339
  (setq projectile-project-root-files-bottom-up
        (cons "CMakeLists.txt" projectile-project-root-files-bottom-up)))

;;  (setq projectile-switch-project-action 'neotree-projectile-action))
(use-package counsel-projectile
  :config (counsel-projectile-mode))
#+end_src
** Magit
#+begin_src emacs-lisp
(use-package magit
  :custom
  (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1))
;; (use-package evil-magit
;;   :after magit)

(setq auth-sources '("~/.authinfo"))
;; https://magit.vc/manual/ghub/Getting-Started.html
;; https://magit.vc/manual/forge
;; TODO: clone github/gitlab repository
(use-package forge
  :after magit
  :config
  (add-to-list 'forge-alist '("git.bilibili.co" "git.bilibili.co/api/v4" "git.bilibili.co" forge-gitlab-repository)))

(use-package diff-hl
  :after magit
  :config
  (global-diff-hl-mode)
  :hook
  (magit-pre-refresh . diff-hl-magit-pre-refresh)
  (magit-post-refresh . diff-hl-magit-post-refresh))
#+end_src

** Snippets
#+begin_src emacs-lisp
(use-package yasnippet
  :config (yas-global-mode 1))
(use-package yasnippet-snippets
  :after yasnippet)
#+end_src
** 自动补全
#+begin_src emacs-lisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
  :custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.0))
(use-package company-box
  :hook (company-mode . company-box-mode))
#+end_src
