emacs/.emacs.d/emacs.org
** Treemacs
#+begin_src emacs-lisp
(use-package treemacs
  :defer t
  :config (treemacs-follow-mode t))
(use-package treemacs-evil :after (treemacs evil))
(use-package treemacs-projectile :after (treemacs projectile))
(use-package treemacs-icons-dired :hook (dired-mode . treemacs-icons-dired-enable-once))
(use-package treemacs-magit :after (treemacs magit))

;; (use-package neotree)
;; (global-set-key (kbd "C-c f e") 'neotree-toggle)
#+end_src

** Lsp
#+begin_src emacs-lisp
(defun aq/lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode)
  (lsp-enable-which-key-integration))

(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :init
  (setq lsp-keymap-prefix "C-c l")
  :hook ((go-mode . lsp-deferred)
         (yaml-mode . lsp-deferred)
         (c-mode . lsp-deferred)
         (c++-mode . lsp-deferred)
         (python-mode . lsp-deferred)
         (java-mode . lsp-deferred)
         (dart-mode . lsp-deferred)
         (meson-mode . lsp-deferred)
         (lsp-mode . aq/lsp-mode-setup)))
;; (lsp-mode . lsp-enable-which-key-integration)))
;;  :config (lsp-enable-which-key-integration t))

(use-package lsp-ui
  :commands (lsp-ui-mode))
;;  :hook (lsp-mode . lsp-ui-mode)
;;  :custom
;;  (lsp-ui-doc-position 'bottom))
(use-package lsp-ivy :commands lsp-ivy-workspace-symbol)
(use-package lsp-treemacs :commands lsp-treemacs-errors-list)

;; (use-package origami)
(use-package lsp-origami
  :hook (lsp-after-open lsp-origami-try-enable))

(use-package dap-mode)
(use-package flycheck
  :ensure t
  :hook
  (after-init #'global-flycheck-mode))
;; :config
;; (add-hook 'after-init-hook #'global-flycheck-mode))
#+end_src
** C++
首次安装时运行 ~dap-cpptools-setup~

[[https://github.com/llvm/llvm-project/blob/main/lldb/tools/lldb-dap/README.md]]

#+begin_src emacs-lisp
(setq-default c-basic-offset 4)

(require 'dap-cpptools)

;; (use-package clang-format) ;; replaced by lsp/clangd
;; (use-package cmake-mode)

(use-package meson-mode)
#+end_src

*** cmake项目配置
1. ~projectile-configure-project~ 运行 ~cmake -S . -B build~
2. ~projectile-run-project~ 可以运行应用 ~./build/myapp~
3. 配置launch.json，示例
    #+begin_src json
    {
        "version": "0.2.0",
        "configurations": [
            {
                "name": "debug myapp",
                "type": "cppdbg",
                "request": "launch",
                "program": "${workspaceFolder}/build/myapp",
                "stopAtEntry": false,
                "cwd": "${workspaceFolder}",
                "environment": [],
                "externalConsole": false,
                "MIDebuggerPath": "/usr/bin/lldb",
                "MIMode": "lldb"
            }
        ]
    }
    #+end_src
4. ~<leader> d d~ 启动dap-debug

*** meson项目配置

1. ~projectile-configure-project~ 运行 ~meson setup build~
1. ~projectile-compile-project~ 运行 ~meson compile -C build~
1. ~projectile-run-project~ 可以运行应用 ~./build/myapp~
1. 配置launch.json，示例
    #+begin_src json
    {
        "version": "0.2.0",
        "configurations": [
            {
                "name": "debug myapp",
                "type": "cppdbg",
                "request": "launch",
                "program": "${workspaceFolder}/build/myapp",
                "stopAtEntry": false,
                "cwd": "${workspaceFolder}",
                "environment": [],
                "externalConsole": false,
                "MIDebuggerPath": "/usr/bin/lldb",
                "MIMode": "lldb"
            }
        ]
    }
    #+end_src
1. ~<leader> d d~ 启动dap-debug
1. 指定compiler，设置环境变量 ~CC=clang~ ，运行 ~meson setup build~

** Python
#+begin_src emacs-lisp
(use-package auto-virtualenvwrapper)
;; :hook
;;  (python-base-mode auto-virtualenvwrapper-activate)
;;  (window-configuration-change auto-virtualenvwrapper-activate)
;;  (focus-in auto-virtualenvwrapper-activate))

(use-package pet
  :after (auto-virtualenvwrapper)
  :config
  (add-hook 'python-base-mode-hook
            (lambda ()
              (auto-virtualenvwrapper-activate) ; activate before pet-mode
              (pet-mode))
            -10))
;; (add-hook 'python-base-mode-hook 'pet-mode -10))
;; :hook (python-base-mode . pet-mode)) ; depth -10

(require 'dap-python)
(setq dap-python-debugger 'debugpy)
#+end_src

*** TODO https://github.com/purcell/envrc

** Golang(TODO remove?)
使用lsp-mode，去除go-mode?

#+begin_src emacs-lisp
(use-package go-mode)
;; (add-hook 'go-mode-hook 'lsp-deferred)
;; Set up before-save hooks to format buffer and add/delete imports.
;; Make sure you don't have other gofmt/goimports hooks enabled.
(defun lsp-go-install-save-hooks ()
 (add-hook 'before-save-hook #'lsp-format-buffer t t)
 (add-hook 'before-save-hook #'lsp-organize-imports t t))
(add-hook 'go-mode-hook #'lsp-go-install-save-hooks)

(defun aq/buf-generate ()
  "run buf generate for proto"
  (interactive)
  (shell-command "buf generate"))
(use-package protobuf-mode
  :bind (("C-c b" . 'aq/buf-generate)))
;;(global-set-key (kbd "C-c b") 'aq/buf-generate)
#+end_src

#+begin_src emacs-lisp
;; (use-package dap-dlv-go)
(require 'dap-dlv-go)

(use-package go-playground)
#+end_src
** Dart/Flutter
#+begin_src emacs-lisp
(use-package dart-mode)
(use-package lsp-dart
  :config
  (setq gc-cons-threshold (* 100 1024 1024)
        read-process-output-max (* 1024 1024)))
#+end_src
** Common Lisp

run by =M-x slime=

#+begin_src emacs-lisp
(load (expand-file-name "~/quicklisp/slime-helper.el"))
;; Replace "sbcl" with the path to your implementation
(setq inferior-lisp-program "sbcl")
#+end_src
** Java
#+begin_src emacs-lisp
;; (require 'lsp-java)
;; (add-hook 'java-mode-hook #'lsp)
(use-package lsp-java
  :hook (java-mode . lsp))
#+end_src
** YAML
#+begin_src emacs-lisp
(use-package yaml-mode)
#+end_src

** TODO 其他配置
- Flycheck
- 远程开发Tramp
* EAF

#+begin_src emacs-lisp
;; See https://github.com/emacs-eaf/emacs-application-framework/wiki/Customization
;; (use-package eaf
;;   :init ((setq eaf-python-command "~/.emacs.d/site-lisp/emacs-application-framework/venv/bin/python3"))
;;   :load-path "~/.emacs.d/site-lisp/emacs-application-framework")
;; :custom
;; (eaf-browser-continue-where-left-off t)
;; (eaf-browser-enable-adblocker t)
;; (browse-url-browser-function 'eaf-open-browser)
;; :config
;; (defalias 'browse-web #'eaf-open-browser)
;; (eaf-bind-key scroll_up "C-n" eaf-pdf-viewer-keybinding)
;; (eaf-bind-key scroll_down "C-p" eaf-pdf-viewer-keybinding)
;; (eaf-bind-key take_photo "p" eaf-camera-keybinding)
;; (eaf-bind-key nil "M-q" eaf-browser-keybinding))
;; unbind, see more in the Wiki

;; (require 'eaf-demo)
;; (require 'eaf-music-player)
;; (require 'eaf-2048)
;; (require 'eaf-terminal)
;; (require 'eaf-image-viewer)
;; (require 'eaf-pdf-viewer)
;; (require 'eaf-browser)
;; (require 'eaf-markdown-previewer)
;; (require 'eaf-file-browser)
;; (require 'eaf-mindmap)
;; (require 'eaf-video-player)
;; (require 'eaf-org-previewer)
;; (require 'eaf-netease-cloud-music)
;; (require 'eaf-system-monitor)
;; (require 'eaf-pyqterminal)
;; (require 'eaf-markmap)
#+end_src

* 杂项
** Lorem
#+begin_src emacs-lisp
(use-package lorem-ipsum)
#+end_src
** misc

#+begin_src emacs-lisp

;; C-x C-e to execute sexp
;; C-h f describe-function

;; move customize to seperate file
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)
#+end_src

TODO
- [X] evil命令
  - [X] =<leader>= key设置
- [ ] projectile懒加载
- [X] use-package init/config区别: init是加载前，config是加载后
- [ ] shell奇怪，会修改签名的值
- [ ] treemacs支持ace-jump
- [ ] 非evil模式支持ace-jump


* Custom Plugin
#+begin_src emacs-lisp
(add-to-list 'load-path
             (concat user-emacs-directory "my-plugins")
             t)
(require 'my-plugin)
;; (use-package my-plugin
;;   :load-path (concat user-emacs-directory "my-plugins/my-plugin.el"))
#+end_src
