emacs/init.el

;; move customize to seperate file
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)

